# SQLite3
## 1. 개요
#### 1.1 경량 DBMS
- 별도의 서버가 필요 없음
- 모바일 기기에서 많이 활용되고 있음
- 파이썬3에 기본 내장되어 있음
- 파일 또는 메모리에 DB 생성
- 참고자료: SQLite로 가볍게 배우는 데이터베이스 (WikiDocs)

#### 1.2 데이터 타입
- 동적 데이터 타입
- Null, Integer, Real, Text, Blob 유형이 있음 (Boolean, Date, Time 없음)
- 다른 유형 데이터를 삽입해도 컬럼에 맞게 알아서 들어감.
- 다른 DB에서 사용하는 데이터유형 이름 그대로 사용해도 무방

#### 1.3 DBMS 관리 툴
- [SQLite Expert](http://www.sqliteexpert.com/download.html)
- Personal version은 freeware 이므로 사용할 수 있음

## 2. 파이썬에서 사용하는 방법

In [75]:
import sqlite3

- **데이터베이스 접속**

In [76]:
conn = sqlite3.connect('./test.db') 
'''
conn = sqlite3.connect(':memory:')    # 메모리 DB 접속(일회성)
'''

"\nconn = sqlite3.connect(':memory:')    # 메모리 DB 접속(일회성)\n"

- **테이블 생성**

In [12]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Eagles \
    (back_no INT NOT NULL, \
     name TEXT, \
     position TEXT, \
     hands TEXT, \
     highschool TEXT, \
     height INT, \
     PRIMARY KEY(back_no));')

- **테이블 삭제**

In [8]:
cur.execute('DROP TABLE Eagles')

- **데이터 삽입(Insert)**
- INSERT INTO Table (field1, f2, ..., fn) VALUES (value1, v2, ..., vn);

In [13]:
cur = conn.cursor()
cur.execute("INSERT INTO Eagles('back_no', 'name', 'position') \
             VALUES (30, '호잉', '외야수');")

- **변경사항 저장**

In [14]:
conn.commit()

- 모든 필드를 삽입할 경우에는 필드명 생략 가능
- 튜플의 리스트 형태로 한꺼번에 여러 데이터를 입력할 수 있음

In [15]:
cur = conn.cursor()
cur.execute("INSERT INTO Eagles VALUES \
    (1, '하주석', '내야수', '우투좌타', '신일고', 184), \
    (28, '양성우', '외야수', '우투좌타', '충암고', 177);")

In [16]:
conn.commit()

- **파일에서 읽어서 데이터베이스에 쓰기**

In [17]:
import pandas as pd
players = pd.read_csv('./players.csv', encoding='EUC-KR')
players

   back_no name position hands highschool  height
0       17  김범수       투수  좌투좌타      천안북일고     181
1       38  안영명       투수  우투우타      천안북일고     183
2       36  장민재       투수  우투우타      광주제일고     184
3       13  최재훈       포수  우투우타        덕수고     178
4       52  김태균      내야수  우투우타      천안북일고     185
5        7  송광민      내야수  우투우타        공주고     184
6       50  이성열      내야수  우투좌타      순천효천고     185
7       43  정은원      내야수  우투좌타        인천고     177
8        8  정근우      외야수  우투우타        부산고     172
9       25  최진행      외야수  우투우타      덕수정보고     188

In [18]:
cur = conn.cursor()
sql = 'INSERT INTO Eagles VALUES (?, ?, ?, ?, ?, ?);'
for i in range(10):
    cur.execute(sql, (int(players.iloc[i,0]), 
                      players.iloc[i,1], players.iloc[i,2], 
                      players.iloc[i,3], players.iloc[i,4], 
                      int(players.iloc[i,5])))
conn.commit()

- **데이터 조회**
- SELECT field1, f2, ..., fn [또는 \*] FROM table <br>
    WHERE 조건<br>
    ORDER BY field [DESC]<br>
    GROUP BY field<br>
    LIMIT 숫자

In [21]:
# 순회 조회
cur = conn.cursor()
cur.execute('SELECT * FROM Eagles')
for row in cur:
    print(row)

(30, '호잉', '외야수', None, None, None)
(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(28, '양성우', '외야수', '우투좌타', '충암고', 177)
(17, '김범수', '투수', '좌투좌타', '천안북일고', 181)
(38, '안영명', '투수', '우투우타', '천안북일고', 183)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)
(13, '최재훈', '포수', '우투우타', '덕수고', 178)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(7, '송광민', '내야수', '우투우타', '공주고', 184)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)
(8, '정근우', '외야수', '우투우타', '부산고', 172)
(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)

In [28]:
# 단건 조회
cur = conn.cursor()
cur.execute('SELECT * FROM Eagles')
row = cur.fetchone()
print(row)

(30, '호잉', '외야수', None, None, None)

In [29]:
# 다건 조회
rows = cur.fetchmany(2)
for row in rows:
    print(row)

(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(28, '양성우', '외야수', '우투좌타', '충암고', 177)

In [30]:
# 모두 조회
rows = cur.fetchall()
for row in rows:
    print(row)

(17, '김범수', '투수', '좌투좌타', '천안북일고', 181)
(38, '안영명', '투수', '우투우타', '천안북일고', 183)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)
(13, '최재훈', '포수', '우투우타', '덕수고', 178)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(7, '송광민', '내야수', '우투우타', '공주고', 184)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)
(8, '정근우', '외야수', '우투우타', '부산고', 172)
(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)

In [31]:
# 필요한 column만 조회, 조회 조건도 추가
cur = conn.cursor()
cur.execute('SELECT name FROM Eagles WHERE back_no > 30')
rows = cur.fetchall();
for row in rows:
    print(row)

('장민재',)
('안영명',)
('정은원',)
('이성열',)
('김태균',)

In [32]:
# 조회 조건
cur = conn.cursor()
cur.execute("SELECT * FROM Eagles WHERE position like '내야수'")
rows = cur.fetchall();
for row in rows:
    print(row)

(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(7, '송광민', '내야수', '우투우타', '공주고', 184)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)

In [33]:
# 원하는 순서
cur = conn.cursor()
cur.execute('SELECT * FROM Eagles ORDER BY height DESC')
rows = cur.fetchall();
for row in rows:
    print(row)

(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)
(7, '송광민', '내야수', '우투우타', '공주고', 184)
(38, '안영명', '투수', '우투우타', '천안북일고', 183)
(17, '김범수', '투수', '좌투좌타', '천안북일고', 181)
(13, '최재훈', '포수', '우투우타', '덕수고', 178)
(28, '양성우', '외야수', '우투좌타', '충암고', 177)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)
(8, '정근우', '외야수', '우투우타', '부산고', 172)
(30, '호잉', '외야수', None, None, None)

In [34]:
# 원하는 순서 및 갯수
cur = conn.cursor()
cur.execute('SELECT * FROM Eagles ORDER BY height DESC LIMIT 5')
rows = cur.fetchall();
for row in rows:
    print(row)

(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)

In [35]:
# 집계 함수
cur.execute('SELECT count(*) FROM Eagles')
count = cur.fetchone()
print(count)

(13,)

In [37]:
# 그룹핑, 집계 함수
cur = conn.cursor()
cur.execute('SELECT position, count(*), avg(height) FROM Eagles GROUP BY position')
rows = cur.fetchall();
for row in rows:
    print(row)

('내야수', 5, 183.0)
('외야수', 4, 179.0)
('투수', 3, 182.66666666666666)
('포수', 1, 178.0)

In [40]:
# Placeholder를 사용해서 데이터 검색
cur = conn.cursor()
back_no = 50
cur.execute('SELECT * FROM Eagles WHERE back_no=?;', (back_no,))
player = cur.fetchone()
print(player)

(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)

- **데이터 변경**
- UPDATE table SET field1 = value1, ... WHERE 조건;

In [41]:
cur = conn.cursor()
cur.execute("UPDATE Eagles SET hands='우투좌타', highschool='미쿡고', \
             height=190 WHERE back_no=30;")
conn.commit()

- **데이터 삭제**
- DELETE FROM table WHERE 조건;

In [42]:
cur = conn.cursor()
cur.execute("DELETE FROM Eagles WHERE back_no=1;")
conn.commit()

## 3. Table Join

In [52]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Stats \
    (id INT NOT NULL, \
     player TEXT, \
     average REAL, \
     rbi INT, \
     homerun INT, \
     PRIMARY KEY(id));')

In [53]:
stats = pd.read_csv('./stats.csv', encoding='EUC-KR')
stats

  player  average  rbi  homerun
0     호잉    0.288   58       15
1    양성우    0.176    6        1
2    최재훈    0.300   23        2
3    김태균    0.308   43        5
4    송광민    0.257   39        6
5    이성열    0.255   62       18
6    정은원    0.281   47        5
7    정근우    0.219   10        2
8    최진행    0.184   14        3

In [54]:
cur = conn.cursor()
sql = 'INSERT INTO Stats VALUES (?, ?, ?, ?, ?);'
for i in range(9):
    cur.execute(sql, (i+1, 
                      stats.iloc[i,0],
                      float(stats.iloc[i,1]), 
                      int(stats.iloc[i,2]),
                      int(stats.iloc[i,3])))
conn.commit()

In [55]:
cur = conn.cursor()
cur.execute('SELECT * FROM Stats')
for row in cur:
    print(row)

(1, '호잉', 0.28800000000000003, 58, 15)
(2, '양성우', 0.17600000000000002, 6, 1)
(3, '최재훈', 0.3, 23, 2)
(4, '김태균', 0.308, 43, 5)
(5, '송광민', 0.257, 39, 6)
(6, '이성열', 0.255, 62, 18)
(7, '정은원', 0.281, 47, 5)
(8, '정근우', 0.21899999999999997, 10, 2)
(9, '최진행', 0.184, 14, 3)

In [58]:
sql = "SELECT Eagles.back_no, Eagles.name, Eagles.position, \
           Stats.average, Stats.rbi, Stats.homerun \
           FROM Eagles JOIN Stats \
           ON Eagles.name like Stats.player;"
cur = conn.cursor()
cur.execute(sql)
for row in cur:
    print(row)

(30, '호잉', '외야수', 0.28800000000000003, 58, 15)
(28, '양성우', '외야수', 0.17600000000000002, 6, 1)
(13, '최재훈', '포수', 0.3, 23, 2)
(52, '김태균', '내야수', 0.308, 43, 5)
(7, '송광민', '내야수', 0.257, 39, 6)
(50, '이성열', '내야수', 0.255, 62, 18)
(43, '정은원', '내야수', 0.281, 47, 5)
(8, '정근우', '외야수', 0.21899999999999997, 10, 2)
(25, '최진행', '외야수', 0.184, 14, 3)

In [67]:
sql = "SELECT e.back_no, e.name, e.position, \
           s.average, s.rbi, s.homerun \
           FROM Eagles AS e JOIN Stats AS s \
           ON e.name like s.player;"
cur = conn.cursor()
cur.execute(sql)
rows = cur.fetchall();
columnName = ['등번호', '선수명', '포지션', '타율', '타점', '홈런']
eagles_df = pd.DataFrame(columns = columnName)
for row in rows:
    eagles_df = eagles_df.append(pd.DataFrame([list(row)], columns = columnName), 
                                 ignore_index=True)
eagles_df

  등번호  선수명  포지션     타율  타점  홈런
0  30   호잉  외야수  0.288  58  15
1  28  양성우  외야수  0.176   6   1
2  13  최재훈   포수  0.300  23   2
3  52  김태균  내야수  0.308  43   5
4   7  송광민  내야수  0.257  39   6
5  50  이성열  내야수  0.255  62  18
6  43  정은원  내야수  0.281  47   5
7   8  정근우  외야수  0.219  10   2
8  25  최진행  외야수  0.184  14   3

#### 연습문제 1
투수들의 기록중에서 평균자책점(ERA), 투구인닝(IP), 탈삼진(SO) 기록을 찾아서  Pitcher_stats 란 테이블을 만들고, Eagles 테이블과 Join 하여 백넘버, 선수명, 포지션, 투구인닝, 평균자책점, 탈삼진 필드를 갖는 데이터 프레임을 만들어서 Join 한 결과를 입력하고, 그 결과를 보이시오.

In [77]:
import pandas as pd

In [70]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Pitcher_stats \
    (id INT NOT NULL, \
     player TEXT, \
     era REAL, \
     ip REAL, \
     so INT, \
     PRIMARY KEY(id));')

In [78]:
pstats = pd.read_csv('./pstats.csv', encoding='EUC-KR')
pstats

  player   era    ip  so
0    장민재  4.81  91.2  84
1    안영명  3.43  44.2  35
2    김범수  5.67  81.0  65

In [72]:
cur = conn.cursor()
sql = 'INSERT INTO Pitcher_stats VALUES (?, ?, ?, ?, ?);'
for i in range(3):
    cur.execute(sql, (i+1, 
                      pstats.iloc[i,0],
                      float(pstats.iloc[i,1]), 
                      float(pstats.iloc[i,2]),
                      int(pstats.iloc[i,3])))
conn.commit()

In [79]:
sql = "SELECT e.back_no, e.name, e.position, \
           p.era, p.ip, p.so \
           FROM Eagles AS e JOIN Pitcher_stats AS p \
           ON e.name like p.player;"
cur = conn.cursor()
cur.execute(sql)
rows = cur.fetchall();
columnPitcher = ['등번호', '선수명', '포지션', '평균자책점', '투구인닝', '탈삼진']
pitcher_df = pd.DataFrame(columns = columnPitcher)
for row in rows:
    pitcher_df = pitcher_df.append(pd.DataFrame([list(row)], columns = columnPitcher), 
                                   ignore_index=True)
pitcher_df

  등번호  선수명 포지션  평균자책점  투구인닝 탈삼진
0  17  김범수  투수   5.67  81.0  65
1  38  안영명  투수   3.43  44.2  35
2  36  장민재  투수   4.81  91.2  84

In [80]:
conn.close()